In [2]:
import numpy as np

#vamos a poner un dicciionario en un np array
data = {'a': 1, 'b': 2, 'c': 3}
array = np.array(list(data.items()))
#usarmeos sort_index 
sorted_array = array[np.argsort(array[:, 0])]
print("Sorted array based on keys:")
print(sorted_array)

Sorted array based on keys:
[['a' '1']
 ['b' '2']
 ['c' '3']]

In [1]:
print("hola mundo")

hola mundo

In [6]:
#panda series a dataframe
import pandas as pd
series = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
df = series.to_frame(name='values')
print("DataFrame from Series:")
print(df)

DataFrame from Series:
   values
a       1
b       2
c       3

In [11]:
sutndet1 = pd.Series({"kor":90, "math":80, "eng":70})
student2 = pd.Series({"kor":70, "math":90, "eng":100})
#suma 
suma = sutndet1 + student2
print("Total scores:")
print(suma)
#resta 
resta = sutndet1 - student2
print("Difference in scores:")
print(resta)
#multiplicacion
multiplicacion = sutndet1 * student2
print("Product of scores:")
print(multiplicacion)
#division
division = sutndet1 / student2
print("Quotient of scores:")
print(division)

Total scores:
kor     160
math    170
eng     170
dtype: int64
Difference in scores:
kor     20
math   -10
eng    -30
dtype: int64
Product of scores:
kor     6300
math    7200
eng     7000
dtype: int64
Quotient of scores:
kor     1.285714
math    0.888889
eng     0.700000
dtype: float64

In [12]:
result = pd.DataFrame([suma, resta, multiplicacion, division], index=['suma', 'resta', 'multiplicacion', 'division'])
print("DataFrame of students' scores:")
print(result)

DataFrame of students' scores:
                        kor         math     eng
suma             160.000000   170.000000   170.0
resta             20.000000   -10.000000   -30.0
multiplicacion  6300.000000  7200.000000  7000.0
division           1.285714     0.888889     0.7

In [13]:
sutndet1 = pd.Series({"kor":90, "math":80, "eng":70})
student2 = pd.Series({"kor":70, "math":90, "eng":100})
sr_add = sutndet1.add(student2)
print("Sum using add method:")
print(sr_add)
sr_sub = sutndet1.sub(student2)
print("Subtraction using sub method:")
print(sr_sub)
sr_mul = sutndet1.mul(student2)
print("Multiplication using mul method:")
print(sr_mul)
sr_div = sutndet1.div(student2)
print("Division using div method:")
print(sr_div)

Sum using add method:
kor     160
math    170
eng     170
dtype: int64
Subtraction using sub method:
kor     20
math   -10
eng    -30
dtype: int64
Multiplication using mul method:
kor     6300
math    7200
eng     7000
dtype: int64
Division using div method:
kor     1.285714
math    0.888889
eng     0.700000
dtype: float64

In [8]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
print("First 5 rows of Titanic dataset:")
print(df.head())
print()
print("imprimir de otra manera")
print()
print(titanic)

First 5 rows of Titanic dataset:
    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

imprimir de otra manera

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [9]:
titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ['age', 'fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [11]:
adiccition = df + 10
print("DataFrame after adding 10 to each element:")
adiccition.head()

DataFrame after adding 10 to each element:

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [14]:
#mostrar columnas age y fare
titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ['age', 'fare']]
df.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [17]:
suma10 = df + 10
suma10.describe()

              age        fare
count  714.000000  891.000000
mean    39.699118   42.204208
std     14.526497   49.693429
min     10.420000   10.000000
25%     30.125000   17.910400
50%     38.000000   24.454200
75%     48.000000   41.000000
max     90.000000  522.329200

In [ ]:
import pandas as pd

# 1. CREAMOS LOS DATOS
# Tabla A: Empleados (ID y Nombre)
df_empleados = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Nombre': ['Ana', 'Beto', 'Carla', 'David'],
    'Depto': ['Ventas', 'IT', 'Ventas', 'RRHH']
})

# Tabla B: Sueldos (ID y Salario) - Fíjate que falta el ID 4 y sobra el ID 5
df_sueldos = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'Salario': [2500, 3000, 2800, 4000]
})

In [19]:
print("--- Tabla Empleados ---")
print(df_empleados)
print("\n--- Tabla Sueldos ---")
print(df_sueldos)

--- Tabla Empleados ---
   ID Nombre   Depto
0   1    Ana  Ventas
1   2   Beto      IT
2   3  Carla  Ventas
3   4  David    RRHH

--- Tabla Sueldos ---
   ID  Salario
0   1     2500
1   2     3000
2   3     2800
3   5     4000

In [20]:

# 2. INNER JOIN (Solo los que están en ambas listas)
# David (4) desaparece porque no tiene sueldo. El 5 desaparece porque no es empleado.
print("\n--- 1. INNER JOIN (Intersección) ---")
print(pd.merge(df_empleados, df_sueldos, on='ID', how='inner'))

--- 1. INNER JOIN (Intersección) ---
   ID Nombre   Depto  Salario
0   1    Ana  Ventas     2500
1   2   Beto      IT     3000
2   3  Carla  Ventas     2800

In [21]:

# 3. LEFT JOIN (Prioridad Empleados)
# David (4) se queda, pero su sueldo será NaN (desconocido).
print("\n--- 2. LEFT JOIN (Manda Empleados) ---")
print(pd.merge(df_empleados, df_sueldos, on='ID', how='left'))

--- 2. LEFT JOIN (Manda Empleados) ---
   ID Nombre   Depto  Salario
0   1    Ana  Ventas   2500.0
1   2   Beto      IT   3000.0
2   3  Carla  Ventas   2800.0
3   4  David    RRHH      NaN

In [ ]:
# 4. OUTER JOIN (Todos dentro)
# Entran todos: David (sin sueldo) y el ID 5 (sueldo sin nombre).
print("\n--- 3. OUTER JOIN (Todos) ---")
print(pd.merge(df_empleados, df_sueldos, on='ID', how='outer'))

--- 3. OUTER JOIN (Todos) ---
   ID Nombre   Depto  Salario
0   1    Ana  Ventas   2500.0
1   2   Beto      IT   3000.0
2   3  Carla  Ventas   2800.0
3   4  David    RRHH      NaN
4   5    NaN     NaN   4000.0

In [28]:
import pandas as pd

# 1. CREAMOS LOS DATOS
# Tabla A: Empleados (ID y Nombre)
df_sueldos = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'Salario': [2500, 3000, 2800, 4000]
})
#ordenar sort_values 
df = df_sueldos.sort_values(by='ID')
print("Sorted array based on keys:")
print(df.head())
#descendente
df_desc = df_sueldos.sort_values(by='ID', ascending=False)
print("Sorted array in descending order based on keys:")
print(df_desc.head())
#ordenar por clase y sueldo
df_multi = df_sueldos.sort_values(by=['Salario', 'ID'])
print("Sorted array based on Salario and ID:")
print(df_multi.head())

Sorted array based on keys:
   ID  Salario
0   1     2500
1   2     3000
2   3     2800
3   5     4000
Sorted array in descending order based on keys:
   ID  Salario
3   5     4000
2   3     2800
1   2     3000
0   1     2500
Sorted array based on Salario and ID:
   ID  Salario
0   1     2500
2   3     2800
1   2     3000
3   5     4000

In [29]:
#Multi-Index (Índices Jerárquicos)
arrays = [
    ['A', 'A', 'B', 'B'],
    [1, 2, 1, 2]
]
index = pd.MultiIndex.from_arrays(arrays, names=('Letra', 'Número'))
df_multi_index = pd.DataFrame({'Valor': [10, 20, 30, 40]}, index=index)
print("DataFrame with Multi-Index:")
print(df_multi_index)

DataFrame with Multi-Index:
              Valor
Letra Número
A     1          10
      2          20
B     1          30
      2          40

In [30]:
import pandas as pd

# --- CREAR DATAFRAME A ---
data_a = {
    'Name': ['Harry Potter', 'David Baker', 'John Smith', 'Juan Martinez', 'Jane Connor'],
    'Gender': ['Male', 'Male', 'Male', 'Male', 'Female'],
    'Age': [23, 31, 22, 36, 30]
}

df_A = pd.DataFrame(data_a)

# --- CREAR DATAFRAME B ---
data_b = {
    'Name': ['John Smith', 'Alex Du Bois', 'Joanne Rowling', 'Jane Connor'],
    'Position': ['Intern', 'Team Lead', 'Manager', 'Manager'],
    'Wage': [25000, 75000, 90000, 70000]
}

df_B = pd.DataFrame(data_b)

# --- VERIFICACIÓN ---
print("--- DataFrame A ---")
print(df_A)
print("\n--- DataFrame B ---")
print(df_B)

--- DataFrame A ---
            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

--- DataFrame B ---
             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [31]:
# --- 1. INNER JOIN (Intersección) ---
# Se queda SOLO con los que están en ambas listas (John Smith y Jane Connor).
print("\n--- 1. INNER JOIN (how='inner') ---")
# Opción corta (por defecto es inner)
inner_1 = pd.merge(df_A, df_B, on='Name') 
# Opción explícita (como en la imagen)
inner_2 = pd.merge(df_A, df_B, on='Name', how='inner') 
print(inner_2)

--- 1. INNER JOIN (how='inner') ---
          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [ ]:

# --- 2. LEFT JOIN (Prioridad Izquierda) ---
# Mantiene a TODOS los de df_A (Harry, David, Juan). 
# Si no encuentra coincidencia en B, pone NaN.
print("\n--- 2. LEFT JOIN (how='left') ---")
left_join = pd.merge(df_A, df_B, on='Name', how='left')
print(left_join)

In [ ]:


# --- 3. RIGHT JOIN (Prioridad Derecha) ---
# Mantiene a TODOS los de df_B (Alex Du Bois, Joanne Rowling).
# Si no están en A, sus datos de 'Gender' y 'Age' serán NaN.
print("\n--- 3. RIGHT JOIN (how='right') ---")
right_join = pd.merge(df_A, df_B, on='Name', how='right')
print(right_join)

In [ ]:


# --- 4. FULL OUTER JOIN (Unión Total) ---
# Nadie se queda fuera. Junta todo.
# Verás muchos NaNs porque rellena los huecos de ambos lados.
print("\n--- 4. FULL OUTER JOIN (how='outer') ---")
outer_join = pd.merge(df_A, df_B, on='Name', how='outer')
print(outer_join)

In [32]:
#ahora concatenaremos
import pandas as pd

# --- CREAR DATAFRAME A ---
data_a = {
    'Name': ['Harry Potter', 'David Baker', 'John Smith', 'Juan Martinez', 'Jane Connor'],
    'Gender': ['Male', 'Male', 'Male', 'Male', 'Female'],
    'Age': [23, 31, 22, 36, 30]
}

df_A = pd.DataFrame(data_a)

# --- CREAR DATAFRAME B ---
data_b = {
    'Name': ['John Smith', 'Alex Du Bois', 'Joanne Rowling', 'Jane Connor'],
    'Position': ['Intern', 'Team Lead', 'Manager', 'Manager'],
    'Wage': [25000, 75000, 90000, 70000]
}

df_B = pd.DataFrame(data_b)

# --- VERIFICACIÓN ---
print("--- DataFrame A ---")
print(df_A)
print("\n--- DataFrame B ---")
print(df_B)
# --- CONCATENAR VERTICALMENTE (FILAS) ---
print("pd.concat([df_A, df_B], sort=True)")
print(pd.concat([df_A, df_B], sort=True))
print("pd.concat([df_A, df_B], axis = 1, sort = True)")
print(pd.concat([df_A, df_B], axis = 1, sort = True))

--- DataFrame A ---
            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

--- DataFrame B ---
             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000
pd.concat([df_A, df_B], sort=True)
    Age  Gender            Name   Position     Wage
0  23.0    Male    Harry Potter        NaN      NaN
1  31.0    Male     David Baker        NaN      NaN
2  22.0    Male      John Smith        NaN      NaN
3  36.0    Male   Juan Martinez        NaN      NaN
4  30.0  Female     Jane Connor        NaN      NaN
0   NaN     NaN      John Smith     Intern  25000.0
1   NaN     NaN    Alex Du Bois  Team Lead  75000.0
2   NaN     NaN  Joanne Rowling    Manager  90000.0
3   NaN     NaN     Jane Connor    Manager  70000.0
pd.concat([df_A, df_B], axis = 1, sort = True)
            Name  Gender  Age            Name   Position     Wage
0   Harry Potter    Male   23      John Smith     Intern  25000.0
1    David Baker    Male   31    Alex Du Bois  Team Lead  75000.0
2     John Smith    Male   22  Joanne Rowling    Manager  90000.0
3  Juan Martinez    Male   36     Jane Connor    Manager  70000.0
4    Jane Connor  Female   30             NaN        NaN      NaN